NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "mesh_friend.h"
#include "nrf_mesh_config_core.h"

#if MESH_FEATURE_FRIEND_ENABLED
#include "nrf_error.h"
#include "nrf_mesh.h"
#include "nrf_mesh_events.h"
#include "event.h"
#include "nrf_mesh_externs.h"
#include "nrf_mesh_utils.h"
#include "nrf_mesh_assert.h"
#include "mesh_opt_friend.h"
#include "mesh_config_entry.h"
#include "net_state.h"

/* For range defines. */
#include "mesh_lpn.h"

#include "friend_queue.h"
#include "friend_sublist.h"
#include "timer_scheduler.h"
#include "core_tx_friend.h"
#include "log.h"

NRF_MESH_STATIC_ASSERT((NRF_MESH_FRIEND_TOKEN_END - NRF_MESH_FRIEND_TOKEN_BEGIN)
                       >= MESH_FRIEND_FRIENDSHIP_COUNT);

#define FRIEND_OFFER_TIMEOUT_MS 1000
#define FRIEND_CLEAR_INITIAL_TIMEOUT_MS 1000
#define FRIEND_POLL_TIMEOUT_MAX_US (UINT32_MAX / 2)

/*****************************************************************************
 * Local typedefs
 *****************************************************************************/

typedef enum
{
    FRIEND_STATE_IDLE,          /**< Ready for new friends. */
    FRIEND_STATE_OFFERING,      /**< Friend Offer sent -- waiting for reply. */
    FRIEND_STATE_ESTABLISHED    /**< In an established friendship. */
} friend_state_t;

/**
 * Friend parameter structure.
 */
typedef struct
{
    mesh_friendship_t friendship;     /**< Friendship parameters. */
    friend_state_t state;             /**< Friend state. */
    uint8_t fsn;                      /**< Friend Sequence Number. */
    friend_queue_t queue;             /**< Friend queue.  */
    friend_sublist_t sublist;         /**< Subscription list of the LPN. */
    timer_event_t poll_timeout;       /**< Poll timeout timer. */
    timer_event_t clear_repeat_timer; /**< Friend clear repeat timer. */
    uint8_t clear_repeat_count;       /**< Number of times to send the friend clear message. */
    core_tx_friend_t bearer;          /**< Bearer instance. */
} friendship_t;

typedef struct
{
    bool enabled;
    uint8_t default_receive_window_ms;
    uint16_t friend_counter;
    nrf_mesh_evt_handler_t mesh_evt_handler;
    friendship_t friends[MESH_FRIEND_FRIENDSHIP_COUNT];
} friend_t;

/*****************************************************************************
* Static globals
*****************************************************************************/
static friend_t m_friend;

/*****************************************************************************
 * Mesh config wrappers
 *****************************************************************************/

static uint32_t friend_setter(mesh_config_entry_id_t entry_id, const void * p_entry)
{
    NRF_MESH_ASSERT_DEBUG(MESH_OPT_FRND_ID_START == entry_id.record);

    const bool enable = *((const bool *) p_entry);

    if (enable && !m_friend.enabled)
    {
        m_friend.enabled = true;
    }
    else if (!enable && m_friend.enabled)
    {
        m_friend.enabled = false;
    }

    return NRF_SUCCESS;
}

static void friend_getter(mesh_config_entry_id_t entry_id, void * p_entry)
{
    NRF_MESH_ASSERT_DEBUG(MESH_OPT_FRND_ID_START == entry_id.record);

    bool * p_enabled = p_entry;
    *p_enabled = m_friend.enabled;
}

static void friend_deleter(mesh_config_entry_id_t entry_id)
{
    NRF_MESH_ASSERT_DEBUG(MESH_OPT_FRND_ID_START == entry_id.record);

    if (m_friend.enabled)
    {
        bool enable = false;
        (void) friend_setter(entry_id, &enable);
    }
}

MESH_CONFIG_ENTRY(mesh_opt_friend,
                  MESH_OPT_FRIEND_EID,
                  1,
                  sizeof(bool),
                  friend_setter,
                  friend_getter,
                  friend_deleter,
                  true);

/* Utility functions */
static timestamp_t remaining_poll_timeout_time_get(const friendship_t * p_friendship)
{
    const timestamp_t time_now = timer_now();
    return (/* MS_TO_US(p_friendship->friendship.poll_timeout_ms) - */
            TIMER_DIFF(p_friendship->poll_timeout.timestamp, time_now));
}

static bool friend_address_is_known(const friendship_t * p_friendship,
                                    nrf_mesh_address_t dst)
{
    if (dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
    {
        return IS_IN_RANGE(dst.value,
                           p_friendship->friendship.lpn.src,
                           (p_friendship->friendship.lpn.src +
                            p_friendship->friendship.lpn.element_count - 1));
    }
    else
    {
        return (NRF_SUCCESS ==
                friend_sublist_contains(&p_friendship->sublist, dst.value));
    }
}

static void friend_tx(friendship_t * p_friendship,
                      transport_control_opcode_t opcode,
                      const packet_mesh_trs_control_packet_t * p_pdu,
                      uint32_t length,
                      const nrf_mesh_network_secmat_t * p_net_secmat,
                      timestamp_t tx_time)
{
    uint16_t local_address;
    uint16_t local_address_count;
    nrf_mesh_unicast_address_get(&local_address, &local_address_count);

    transport_control_packet_t control_packet;
    memset(&control_packet, 0, sizeof(control_packet));
    control_packet.opcode = opcode;
    control_packet.p_data = p_pdu;
    control_packet.data_len = length;
    control_packet.src = local_address;
    control_packet.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    control_packet.dst.value = p_friendship->friendship.lpn.src;
    control_packet.p_net_secmat = p_net_secmat;
    control_packet.ttl = 0;
    control_packet.bearer_selector = CORE_TX_BEARER_TYPE_FRIEND;
    uint32_t status = transport_control_tx(&control_packet,
                                           p_friendship->bearer.token);

    if (status != NRF_SUCCESS)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_WARN, "TX failed: status: %d\n", status);
    }

    if (status == NRF_SUCCESS)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friend TX: opcode:%u nid:0x%02x dst:0x%04x tx_time:%u \n", control_packet.opcode, control_packet.p_net_secmat->nid, control_packet.dst.value, tx_time);
        __LOG_XB(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friend TX", (const uint8_t *) control_packet.p_data, control_packet.data_len);
        core_tx_friend_schedule(&p_friendship->bearer, tx_time);
    }
}

