NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
static void friendship_state_reset(friendship_t * p_friendship)
{
    memset(&p_friendship->friendship, 0, sizeof(mesh_friendship_t));
    p_friendship->state = FRIEND_STATE_IDLE;
    core_tx_friend_disable(&p_friendship->bearer);
    friend_queue_clear(&p_friendship->queue);
    friend_sublist_clear(&p_friendship->sublist);
    timer_sch_abort(&p_friendship->poll_timeout);
}

static void friendship_terminate(friendship_t * p_friendship,
                                 nrf_mesh_evt_friendship_terminated_reason_t reason)
{
    NRF_MESH_ASSERT_DEBUG(p_friendship->state != FRIEND_STATE_IDLE);

    nrf_mesh_evt_t evt;
    uint16_t dummy_element_count;
    nrf_mesh_unicast_address_get(&evt.params.friendship_terminated.friend_src,
                                 &dummy_element_count);

    evt.type = NRF_MESH_EVT_FRIENDSHIP_TERMINATED;
    evt.params.friendship_terminated.lpn_src = p_friendship->friendship.lpn.src;
    evt.params.friendship_terminated.reason = reason;

    friendship_state_reset(p_friendship);
    event_handle(&evt);

    __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friendship terminated reason %u\n", reason);
}

static bool friendship_is_active(const friendship_t * p_friendship)
{
    return (p_friendship->state != FRIEND_STATE_IDLE);
}

static uint32_t sublist_address_count_get(const transport_control_packet_t * p_packet)
{
    /* PDU format: [ transaction_number | addr1, ... , addrN         ].
     *             | byte 0             | 1  2 | ... | size-2 size-1 |
     */
    return (p_packet->data_len - 1) / 2;
}

static timestamp_t friend_offer_delay_get(mesh_friendship_receive_window_factor_t receive_window_factor,
                                          mesh_friendship_rssi_factor_t rssi_factor,
                                          uint16_t receive_window_ms,
                                          int8_t rssi)
{
    int delay = ((int) receive_window_factor * receive_window_ms -
                 (int) rssi_factor * rssi);

    /* Mesh Profile v1.0, 3.6.6.3.1 p. 79: Local Delay shall have a lower bound
     * of 100ms. */
    return (timestamp_t) (delay < 100) ? 100 : delay;
}

static bool friend_clear_is_valid_lpn_counter(uint16_t friend_request_lpn_counter,
                                              uint16_t friend_clear_lpn_counter)
{
    /* Mesh Profile v1.0, sec. 3.6.4.6, p 71:
     *
     * A Friend Clear message is considered valid if the result of the
     * subtraction of the value of the LPNCounter field of the Friend Request
     * message (the one that initiated the friendship) from the value of the
     * LPNCounter field of the Friend Clear message, modulo 65536, is in the
     * range 0 to 255 inclusive. */
    return ((friend_clear_lpn_counter - friend_request_lpn_counter) < 256);
}

static void repeat_count_set(friendship_t * p_friendship)
{
    /* A Friend Clear Procedure timer shall be started with the period equal to
     * two times the Friend Poll Timeout value. */
    uint64_t repeat_timeout_us =
        MS_TO_US((uint64_t) p_friendship->friendship.poll_timeout_ms) * 2;

    while ((repeat_timeout_us >>= 1) != 0)
    {
        p_friendship->clear_repeat_count++;
    }
}

static friendship_t * friendship_find(uint16_t lpn_address)
{
    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        if (m_friend.friends[i].friendship.lpn.src == lpn_address)
        {
            return &m_friend.friends[i];
        }
    }
    return NULL;
}

static void poll_timeout_schedule(friendship_t * p_friendship,
                                  timestamp_t poll_timeout_us)
{
    timer_sch_reschedule(&p_friendship->poll_timeout, poll_timeout_us);
}

static void friend_clear_timeout_schedule(friendship_t * p_friendship)
{
    NRF_MESH_ASSERT_DEBUG(p_friendship->clear_repeat_count > 0);
    timer_sch_reschedule(&p_friendship->clear_repeat_timer,
                         timer_now() + MS_TO_US(FRIEND_CLEAR_INITIAL_TIMEOUT_MS));
}

static void friend_clear_interval_update(friendship_t * p_friendship)
{
    NRF_MESH_ASSERT_DEBUG(p_friendship->clear_repeat_count > 0);
    /* TODO: Long running timer. */
    p_friendship->clear_repeat_timer.interval =
        MIN((uint64_t) 2 * p_friendship->clear_repeat_timer.interval,
            FRIEND_POLL_TIMEOUT_MAX_US);
    p_friendship->clear_repeat_count--;
}


static friendship_t * free_friendship_context_get(void)
{
    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        if (m_friend.friends[i].state == FRIEND_STATE_IDLE)
        {
            return &m_friend.friends[i];
        }
    }
    return NULL;
}

static uint32_t friendship_alloc(friendship_t ** pp_friendship,
                                 const transport_control_packet_t * p_control_packet)
{
    uint32_t receive_delay_ms = packet_mesh_trs_control_friend_request_receive_delay_get(p_control_packet->p_data);
    uint64_t poll_timeout_ms =
        (uint64_t) packet_mesh_trs_control_friend_request_poll_timeout_get(p_control_packet->p_data) * 100;
    uint16_t prev_friend_src =
        packet_mesh_trs_control_friend_request_previous_address_get(p_control_packet->p_data);
    uint8_t min_queue_size_log =
        packet_mesh_trs_control_friend_request_min_queue_size_log_get(p_control_packet->p_data);
    uint8_t num_elements =
        packet_mesh_trs_control_friend_request_num_elements_get(p_control_packet->p_data);

    if (p_control_packet->dst.value != NRF_MESH_ALL_FRIENDS_ADDR ||
        !IS_IN_RANGE(receive_delay_ms,
                     MESH_LPN_RECEIVE_DELAY_MIN_MS,
                     MESH_LPN_RECEIVE_DELAY_MAX_MS) ||
        !IS_IN_RANGE(poll_timeout_ms,
                     MESH_LPN_POLL_TIMEOUT_MIN_MS,
                     MESH_LPN_POLL_TIMEOUT_MAX_MS) ||
        (prev_friend_src != NRF_MESH_ADDR_UNASSIGNED &&
         nrf_mesh_address_type_get(prev_friend_src) != NRF_MESH_ADDRESS_TYPE_UNICAST) ||
        min_queue_size_log == 0 ||
        num_elements == 0)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    else if ((1 << min_queue_size_log) > MESH_FRIEND_QUEUE_SIZE)
    {
        return NRF_ERROR_RESOURCES;
    }
    else if (MS_TO_US(poll_timeout_ms) > FRIEND_POLL_TIMEOUT_MAX_US)
    {
        /* TODO: Long running timer. */
        return NRF_ERROR_NOT_SUPPORTED;
    }

    /* TODO: More parameter sanitazion? */

    *pp_friendship = friendship_find(p_control_packet->src);
    if (*pp_friendship != NULL)
    {
        /* A new friend request from a known friend means we should consider the
         * existing friendship lost (Mesh Profile 1.0, sec. 3.6.6.3.1,  p. 79).*/
        friendship_terminate(*pp_friendship,
                             NRF_MESH_EVT_FRIENDSHIP_TERMINATED_REASON_NEW_FRIEND_REQUEST);
    }
    else
    {
        *pp_friendship = free_friendship_context_get();
    }

