NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
    if (*pp_friendship == NULL)
    {
        return NRF_ERROR_NO_MEM;
    }

    core_tx_friend_enable(&(*pp_friendship)->bearer);
    nrf_mesh_keygen_friendship_secmat_params_t secmat_params;
    secmat_params.lpn_address    = p_control_packet->src;
    secmat_params.lpn_counter    = packet_mesh_trs_control_friend_request_lpn_counter_get(p_control_packet->p_data);
    secmat_params.friend_counter = m_friend.friend_counter;

    uint16_t dummy_element_count;
    nrf_mesh_unicast_address_get(&secmat_params.friend_address, &dummy_element_count);

    uint32_t status = nrf_mesh_friendship_secmat_params_set(
        p_control_packet->p_net_secmat, &secmat_params);

    if (status != NRF_SUCCESS)
    {
        return status;
    }

    (*pp_friendship)->friendship.lpn.src = p_control_packet->src;
    (*pp_friendship)->friendship.lpn.prev_friend_src = prev_friend_src;
    (*pp_friendship)->friendship.lpn.element_count = num_elements;

    (*pp_friendship)->friendship.lpn.request_count =
        packet_mesh_trs_control_friend_request_lpn_counter_get(p_control_packet->p_data);

    (*pp_friendship)->friendship.poll_timeout_ms = (uint32_t) poll_timeout_ms;
    (*pp_friendship)->friendship.receive_delay_ms = receive_delay_ms;
    (*pp_friendship)->friendship.receive_window_ms = m_friend.default_receive_window_ms;

    (*pp_friendship)->state = FRIEND_STATE_OFFERING;
    return NRF_SUCCESS;
}


static void rssi_update(friendship_t * p_friendship,
                        const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    /* TODO: decide on weighted average. Do we care for
     * optimizations/configurability here at all? */
    p_friendship->friendship.avg_rssi = (p_friendship->friendship.avg_rssi +
                                         p_rx_metadata->params.scanner.rssi) / 2;
}

static void friend_update_tx(friendship_t * p_friendship,
                             const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    const nrf_mesh_network_secmat_t * p_net_secmat = NULL;
    nrf_mesh_friendship_secmat_get(p_friendship->friendship.lpn.src,
                                   &p_net_secmat);
    NRF_MESH_ASSERT_DEBUG(p_net_secmat != NULL);
    packet_mesh_trs_control_packet_t friend_update;
    memset(&friend_update, 0, PACKET_MESH_TRS_CONTROL_FRIEND_UPDATE_SIZE);

    packet_mesh_trs_control_friend_update_key_refresh_flag_set(
        &friend_update, (nrf_mesh_key_refresh_phase_get(p_net_secmat)
                          == NRF_MESH_KEY_REFRESH_PHASE_2));
    packet_mesh_trs_control_friend_update_iv_update_flag_set(
        &friend_update, (net_state_iv_update_get() == NET_STATE_IV_UPDATE_IN_PROGRESS));
    packet_mesh_trs_control_friend_update_iv_index_set(
        &friend_update, net_state_beacon_iv_index_get());
    packet_mesh_trs_control_friend_update_md_set(
        &friend_update, !friend_queue_is_empty(&p_friendship->queue));

    friend_tx(p_friendship,
              TRANSPORT_CONTROL_OPCODE_FRIEND_UPDATE,
              &friend_update,
              PACKET_MESH_TRS_CONTROL_FRIEND_UPDATE_SIZE,
              p_net_secmat,
              (p_rx_metadata->params.scanner.timestamp +
               MS_TO_US(p_friendship->friendship.receive_delay_ms)));
}

static void friend_relay(friendship_t * p_friendship,
                         const friend_packet_t * p_packet,
                         const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    const nrf_mesh_network_secmat_t * p_friend_secmat = NULL;
    nrf_mesh_friendship_secmat_get(p_friendship->friendship.lpn.src,
                                   &p_friend_secmat);

    network_tx_packet_buffer_t net_buf;
    network_packet_metadata_t net_metadata;

    net_metadata.dst.type = nrf_mesh_address_type_get(p_packet->net_metadata.dst);
    net_metadata.dst.value = p_packet->net_metadata.dst;
    net_metadata.src = p_packet->net_metadata.src;
    net_metadata.ttl = p_packet->net_metadata.ttl > 0 ? p_packet->net_metadata.ttl - 1 : 0;
    net_metadata.control_packet = p_packet->net_metadata.control_packet;
    net_metadata.internal.sequence_number = p_packet->net_metadata.seqnum;
    net_metadata.internal.iv_index = p_packet->net_metadata.iv_index;
    net_metadata.p_security_material = p_friend_secmat;

    net_buf.user_data.p_metadata = &net_metadata;
    net_buf.user_data.token = p_friendship->bearer.token;
    net_buf.user_data.payload_len = p_packet->length;
    net_buf.user_data.bearer_selector = CORE_TX_BEARER_TYPE_FRIEND;
    net_buf.user_data.role = p_packet->role;

    if (packet_mesh_trs_control_opcode_get(&p_packet->packet) == TRANSPORT_CONTROL_OPCODE_FRIEND_UPDATE)
    {
        /* The queue may have gotten additional packets since we pushed the
         * update. */
        packet_mesh_trs_control_friend_update_md_set(
            (packet_mesh_trs_control_packet_t*) &p_packet->packet.pdu[PACKET_MESH_TRS_UNSEG_PDU_OFFSET],
            !friend_queue_is_empty(&p_friendship->queue));
    }

    uint32_t status = network_packet_alloc(&net_buf);
    if (status == NRF_SUCCESS)
    {
        memcpy(net_buf.p_payload, p_packet->packet.pdu, p_packet->length);
        network_packet_send(&net_buf);
        core_tx_friend_schedule(&p_friendship->bearer,
                                (p_rx_metadata->params.scanner.timestamp +
                                 MS_TO_US(p_friendship->friendship.receive_delay_ms)));
    }
    else
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_WARN, "Unable to allocate packet for relay %u\n", status);
    }
}

static void friend_sublist_confirm_tx(friendship_t * p_friendship,
                                      uint8_t transaction_number,
                                      const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    const nrf_mesh_network_secmat_t * p_net_secmat = NULL;
    nrf_mesh_friendship_secmat_get(p_friendship->friendship.lpn.src,
                                   &p_net_secmat);
    NRF_MESH_ASSERT_DEBUG(p_net_secmat != NULL);
    /* No need to go through the whole packet_mesh.h scheme with only one-byte
     * payload... */
    friend_tx(p_friendship,
              TRANSPORT_CONTROL_OPCODE_FRIEND_SUBSCRIPTION_LIST_CONFIRM,
              (const packet_mesh_trs_control_packet_t *) &transaction_number,
              sizeof(transaction_number),
              p_net_secmat,
              (p_rx_metadata->params.scanner.timestamp +
               MS_TO_US(p_friendship->friendship.receive_delay_ms)));
}

static void friend_clear_tx(friendship_t * p_friendship)
{
    uint16_t local_address;
    uint16_t local_address_count;
    nrf_mesh_unicast_address_get(&local_address, &local_address_count);

    packet_mesh_trs_control_packet_t friend_clear;
    memset(&friend_clear, 0, sizeof(friend_clear));
    packet_mesh_trs_control_friend_clear_lpn_address_set(
        &friend_clear, p_friendship->friendship.lpn.src);
    packet_mesh_trs_control_friend_clear_lpn_counter_set(
        &friend_clear, p_friendship->friendship.lpn.request_count);

    const nrf_mesh_network_secmat_t * p_friendship_secmat = NULL;
    const nrf_mesh_network_secmat_t * p_master_secmat = NULL;

