NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
    nrf_mesh_friendship_secmat_get(p_friendship->friendship.lpn.src,
                                   &p_friendship_secmat);
    NRF_MESH_ASSERT_DEBUG(p_friendship_secmat != NULL);

    p_master_secmat = nrf_mesh_net_master_secmat_get(p_friendship_secmat);
    NRF_MESH_ASSERT_DEBUG(p_master_secmat != NULL);

    transport_control_packet_t control_packet;
    memset(&control_packet, 0, sizeof(control_packet));
    control_packet.opcode = TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR;
    control_packet.p_data = &friend_clear;
    control_packet.data_len = PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_SIZE;
    control_packet.src = local_address;
    control_packet.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    control_packet.dst.value = p_friendship->friendship.lpn.prev_friend_src;
    control_packet.p_net_secmat = p_master_secmat;
    control_packet.ttl = NRF_MESH_TTL_MAX;
    control_packet.bearer_selector = CORE_TX_BEARER_TYPE_ADV;
    uint32_t status = transport_control_tx(&control_packet,
                                           p_friendship->bearer.token);
    NRF_MESH_ASSERT_DEBUG(status == NRF_SUCCESS ||
                          status == NRF_ERROR_FORBIDDEN ||
                          status == NRF_ERROR_NO_MEM);
}

static void friend_clear_confirm_tx(friendship_t * p_friendship,
                                    const transport_control_packet_t * p_clear_packet)
{
    packet_mesh_trs_control_packet_t friend_clear_confirm;
    memset(&friend_clear_confirm, 0, sizeof(friend_clear_confirm));
    packet_mesh_trs_control_friend_clear_confirm_lpn_address_set(
        &friend_clear_confirm, p_friendship->friendship.lpn.src);
    packet_mesh_trs_control_friend_clear_confirm_lpn_counter_set(
        &friend_clear_confirm, p_friendship->friendship.lpn.request_count);

    transport_control_packet_t control_packet;
    memset(&control_packet, 0, sizeof(control_packet));
    control_packet.opcode = TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR_CONFIRM;
    control_packet.p_data = &friend_clear_confirm;
    control_packet.data_len = PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_CONFIRM_SIZE;
    control_packet.src = p_clear_packet->dst.value;
    control_packet.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    control_packet.dst.value = p_clear_packet->src;
    control_packet.p_net_secmat = p_clear_packet->p_net_secmat;
    control_packet.ttl = p_clear_packet->ttl == 0 ? 0 : NRF_MESH_TTL_MAX;
    control_packet.bearer_selector = CORE_TX_BEARER_TYPE_ALLOW_ALL;
    uint32_t status = transport_control_tx(&control_packet,
                                           p_friendship->bearer.token);
    NRF_MESH_ASSERT_DEBUG(status == NRF_SUCCESS ||
                          status == NRF_ERROR_FORBIDDEN);
}

static void poll_timeout_cb(timestamp_t timeout, void * p_context)
{
    NRF_MESH_ASSERT_DEBUG(p_context != NULL);
    friendship_t * p_friendship = p_context;

    friendship_terminate(p_friendship,
                         NRF_MESH_EVT_FRIENDSHIP_TERMINATED_REASON_TIMEOUT);
}

static void friend_clear_timeout_cb(timestamp_t timeout, void * p_context)
{
    friendship_t * p_friendship = p_context;
    if (p_friendship->clear_repeat_count > 0)
    {
        friend_clear_tx(p_friendship);
        friend_clear_interval_update(p_friendship);
    }
    else
    {
        timer_sch_abort(&p_friendship->clear_repeat_timer);
    }
}

/*******************************************************************************
 * Transport opcode handler callbacks
 *******************************************************************************/

static void friend_poll_handle(const transport_control_packet_t * p_control_packet,
                               const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    NRF_MESH_ASSERT_DEBUG(p_control_packet != NULL);
    NRF_MESH_ASSERT_DEBUG(p_rx_metadata != NULL);
    if (!m_friend.enabled ||
        p_control_packet->data_len != PACKET_MESH_TRS_CONTROL_FRIEND_POLL_SIZE ||
        (p_control_packet->p_data->pdu[PACKET_MESH_TRS_CONTROL_FRIEND_POLL_FSN_OFFSET] &
         PACKET_MESH_TRS_CONTROL_FRIEND_POLL_FSN_MASK_INV) != 0)
    {
        return;
    }
    friendship_t * p_friendship = friendship_find(p_control_packet->src);
    if (p_friendship == NULL)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Received poll from unkown LPN 0x%04x\n", p_control_packet->src);
        return;
    }

    uint8_t fsn = packet_mesh_trs_control_friend_poll_fsn_get(p_control_packet->p_data);
    __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1,
          "Friend poll (0x%04x): fsn: %u (prev: %u)\n",
          p_friendship->friendship.lpn.src, fsn, p_friendship->fsn);

    rssi_update(p_friendship, p_rx_metadata);
    switch (p_friendship->state)
    {
        case FRIEND_STATE_OFFERING:
        {
            uint16_t unicast_address;
            uint16_t dummy_count;
            nrf_mesh_unicast_address_get(&unicast_address, &dummy_count);

            p_friendship->fsn = fsn;
            p_friendship->state = FRIEND_STATE_ESTABLISHED;
            friend_update_tx(p_friendship, p_rx_metadata);
            if (p_friendship->friendship.lpn.prev_friend_src != NRF_MESH_ADDR_UNASSIGNED &&
                p_friendship->friendship.lpn.prev_friend_src != unicast_address)
            {
                repeat_count_set(p_friendship);
                friend_clear_tx(p_friendship);
                friend_clear_timeout_schedule(p_friendship);
            }
            __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friendship established (0x%04x)\n",
                  p_friendship->friendship.lpn.src);
            break;
        }
        case FRIEND_STATE_ESTABLISHED:
        {
            if (p_friendship->fsn != fsn)
            {
                friend_queue_packet_release(&p_friendship->queue);
            }
            p_friendship->fsn = fsn;

            const friend_packet_t * p_packet = friend_queue_packet_get(&p_friendship->queue);
            if (p_packet == NULL)
            {
                friend_update_tx(p_friendship, p_rx_metadata);
            }
            else
            {
                friend_relay(p_friendship, p_packet, p_rx_metadata);
            }
            break;
        }
        default:
            NRF_MESH_ASSERT_DEBUG(false);
            break;
    }

    poll_timeout_schedule(p_friendship,
                          (p_rx_metadata->params.scanner.timestamp +
                           MS_TO_US(p_friendship->friendship.poll_timeout_ms)));
}

static void friend_request_handle(const transport_control_packet_t * p_control_packet,
                                  const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    NRF_MESH_ASSERT_DEBUG(p_control_packet != NULL);
    NRF_MESH_ASSERT_DEBUG(p_rx_metadata != NULL);
    if (!m_friend.enabled ||
        p_control_packet->data_len != PACKET_MESH_TRS_CONTROL_FRIEND_REQUEST_SIZE)
    {
        return;
    }

