NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
    friendship_t * p_friendship = NULL;
    uint32_t status = friendship_alloc(&p_friendship, p_control_packet);
    if (status != NRF_SUCCESS)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_WARN, "Error %u: Not able to allocate friendship\n", status);
        return;
    }
    NRF_MESH_ASSERT_DEBUG(p_friendship != NULL);
    p_friendship->friendship.avg_rssi = p_rx_metadata->params.scanner.rssi;

    nrf_mesh_evt_t evt;
    evt.type = NRF_MESH_EVT_FRIEND_REQUEST;
    evt.params.friend_request.p_friendship = &p_friendship->friendship;
    evt.params.friend_request.p_net = p_control_packet->p_net_secmat;
    evt.params.friend_request.p_metadata = p_rx_metadata;
    event_handle(&evt);

    /* NOTE: At this point, the application may have called mesh_friend_friendship_terminate()
     * so we need to check if we're still in a friendship or not.
     */
    if (!friendship_is_active(p_friendship))
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Application cancelled friend request\n");
        NRF_MESH_ASSERT_DEBUG(p_friendship->state == FRIEND_STATE_IDLE);

        /* Ensure that the secmat has been removed from DSM. */
        const nrf_mesh_network_secmat_t * p_secmat;
        nrf_mesh_friendship_secmat_get(p_control_packet->src, &p_secmat);
        NRF_MESH_ASSERT_DEBUG(p_secmat == NULL);

        return;
    }

    packet_mesh_trs_control_packet_t friend_offer_pdu;
    memset(&friend_offer_pdu, 0, PACKET_MESH_TRS_CONTROL_FRIEND_OFFER_SIZE);
    packet_mesh_trs_control_friend_offer_receive_window_set(
        &friend_offer_pdu, p_friendship->friendship.receive_window_ms);

    packet_mesh_trs_control_friend_offer_queue_size_set(
        &friend_offer_pdu, MESH_FRIEND_QUEUE_SIZE);

    packet_mesh_trs_control_friend_offer_subscription_list_size_set(
        &friend_offer_pdu, MESH_FRIEND_SUBLIST_SIZE);

    packet_mesh_trs_control_friend_offer_rssi_set(
        &friend_offer_pdu, p_rx_metadata->params.scanner.rssi);

    packet_mesh_trs_control_friend_offer_friend_counter_set(
        &friend_offer_pdu, m_friend.friend_counter++);

    mesh_friendship_receive_window_factor_t receive_window_factor =
        (mesh_friendship_receive_window_factor_t)
        packet_mesh_trs_control_friend_request_receive_window_factor_get(p_control_packet->p_data);
    mesh_friendship_rssi_factor_t rssi_factor =
        (mesh_friendship_rssi_factor_t)
        packet_mesh_trs_control_friend_request_rssi_factor_get(p_control_packet->p_data);

    uint32_t offer_delay_ms =
        friend_offer_delay_get(receive_window_factor,
                               rssi_factor,
                               p_friendship->friendship.receive_window_ms,
                               p_rx_metadata->params.scanner.rssi);

    __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friend request (0x%04x): "
          "offer delay: %u, rDelay: %u, pTimeout: %u, prevAddr: 0x%04x, elements: %u\n",
          p_friendship->friendship.lpn.src,
          offer_delay_ms,
          p_friendship->friendship.receive_delay_ms,
          p_friendship->friendship.poll_timeout_ms,
          p_friendship->friendship.lpn.prev_friend_src,
          p_friendship->friendship.lpn.element_count);
    __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friend offer: "
          "rWindow: %u, queueSize: %u, sublistSize: %u, rssi: %d, fcnt: %u\n",
          p_friendship->friendship.receive_window_ms,
          MESH_FRIEND_QUEUE_SIZE,
          MESH_FRIEND_SUBLIST_SIZE,
          p_rx_metadata->params.scanner.rssi,
          m_friend.friend_counter - 1);

    friend_tx(p_friendship,
              TRANSPORT_CONTROL_OPCODE_FRIEND_OFFER,
              &friend_offer_pdu,
              PACKET_MESH_TRS_CONTROL_FRIEND_OFFER_SIZE,
              p_control_packet->p_net_secmat,
              (p_rx_metadata->params.scanner.timestamp +
               MS_TO_US(offer_delay_ms)));

    /* If we don't receive a Friend Poll within 1 second after sending the
     * Friend Offer, the establishment has failed. */
    poll_timeout_schedule(p_friendship,
                          (p_rx_metadata->params.scanner.timestamp +
                           MS_TO_US(FRIEND_OFFER_TIMEOUT_MS + offer_delay_ms)));
}

static void friend_clear_handle(const transport_control_packet_t * p_control_packet,
                                const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    NRF_MESH_ASSERT_DEBUG(p_control_packet != NULL);
    NRF_MESH_ASSERT_DEBUG(p_rx_metadata != NULL);
    if (!m_friend.enabled ||
        p_control_packet->data_len != PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_SIZE)
    {
        return;
    }

    uint16_t lpn_address = packet_mesh_trs_control_friend_clear_lpn_address_get(
        p_control_packet->p_data);
    uint16_t lpn_counter = packet_mesh_trs_control_friend_clear_lpn_counter_get(
        p_control_packet->p_data);

    friendship_t * p_friendship = friendship_find(lpn_address);
    if (p_friendship == NULL)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1,
              "Received Friend Clear for unknown LPN 0x%04x from 0x%04x\n",
              lpn_address, p_control_packet->src);
        return;
    }
    else if (!friend_clear_is_valid_lpn_counter(p_friendship->friendship.lpn.request_count,
                                                lpn_counter))
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Invalid LPNCounter: %u != %u\n",
              lpn_counter, p_friendship->friendship.lpn.request_count);
        return;
    }

    /* FIXME: The Friend should cache old friends until the poll timeout of the
     * friendship. This is to adhere to the requirement (Mesh Profile v1.0, sec.
     * 3.6.5.6):
     *
     * > The message should only be sent in response to a valid Friend Clear
     *   message received within the Poll Timeout of the previous friend
     *   relationship, but it should send a Friend Clear Confirm message for
     *   each valid Friend Clear message that it receives in that period.
     */
    friend_clear_confirm_tx(p_friendship, p_control_packet);
    friendship_terminate(p_friendship, NRF_MESH_EVT_FRIENDSHIP_TERMINATED_REASON_NEW_FRIEND);
}

