NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
static void friend_clear_confirm_handle(const transport_control_packet_t * p_control_packet,
                                        const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    NRF_MESH_ASSERT_DEBUG(p_control_packet != NULL);
    NRF_MESH_ASSERT_DEBUG(p_rx_metadata != NULL);
    if (!m_friend.enabled ||
        p_control_packet->data_len != PACKET_MESH_TRS_CONTROL_FRIEND_CLEAR_CONFIRM_SIZE)
    {
        return;
    }

    uint16_t lpn_address = packet_mesh_trs_control_friend_clear_confirm_lpn_address_get(
        p_control_packet->p_data);
    uint16_t lpn_counter = packet_mesh_trs_control_friend_clear_confirm_lpn_counter_get(
        p_control_packet->p_data);

    friendship_t * p_friendship = friendship_find(lpn_address);
    if (p_friendship == NULL)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1,
              "Received Friend Clear Confirm for unknown LPN 0x%04x from 0x%04x\n",
              lpn_address, p_control_packet->src);
        return;
    }
    else if (p_friendship->friendship.lpn.request_count != lpn_counter)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Unexpected LPNCounter: %u != %u\n",
              lpn_counter, p_friendship->friendship.lpn.request_count);
        return;
    }

    timer_sch_abort(&p_friendship->clear_repeat_timer);
}

static void friend_sublist_add_handle(const transport_control_packet_t * p_control_packet,
                                      const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    NRF_MESH_ASSERT_DEBUG(p_control_packet != NULL);
    NRF_MESH_ASSERT_DEBUG(p_rx_metadata != NULL);

    if (!m_friend.enabled)
    {
        return;
    }

    friendship_t * p_friendship = friendship_find(p_control_packet->src);
    if (p_friendship == NULL)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Received sublist add from unkown LPN 0x%04x\n", p_control_packet->src);
        return;
    }

    uint8_t transaction_number =
        packet_mesh_trs_control_friend_sublist_add_remove_transaction_number_get(
            p_control_packet->p_data);

    uint32_t status = NRF_SUCCESS;
    const uint32_t address_count = sublist_address_count_get(p_control_packet);

    /* NOTE: There is no NACK support for an LPN "misbehaving", i.e., adding
     * more addresses than the subscription list can hold. */
    for (uint32_t i = 0;
         i < address_count && status == NRF_SUCCESS;
         ++i)
    {
        uint16_t address =
            packet_mesh_trs_control_friend_sublist_add_remove_address_list_get(
                p_control_packet->p_data, i);
        status = friend_sublist_add(&p_friendship->sublist, address);
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Add sublist addr 0x%04x: %u\n", address, status);
    }

    if (status != NRF_SUCCESS)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Error %u: adding to sublist 0x%04x\n",
              status, p_friendship->friendship.lpn.src);
    }
    else
    {
        friend_sublist_confirm_tx(p_friendship, transaction_number, p_rx_metadata);
    }

    poll_timeout_schedule(p_friendship,
                          (p_rx_metadata->params.scanner.timestamp +
                           MS_TO_US(p_friendship->friendship.poll_timeout_ms)));
}

static void friend_sublist_remove_handle(const transport_control_packet_t * p_control_packet,
                                         const nrf_mesh_rx_metadata_t * p_rx_metadata)
{
    NRF_MESH_ASSERT_DEBUG(p_control_packet != NULL);
    NRF_MESH_ASSERT_DEBUG(p_rx_metadata != NULL);

    if (!m_friend.enabled)
    {
        return;
    }

    friendship_t * p_friendship = friendship_find(p_control_packet->src);
    if (p_friendship == NULL)
    {
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Received sublist remove from unkown LPN 0x%04x\n", p_control_packet->src);
        return;
    }

    uint8_t transaction_number =
        packet_mesh_trs_control_friend_sublist_add_remove_transaction_number_get(
            p_control_packet->p_data);

    for (uint32_t i = 0;
         i < sublist_address_count_get(p_control_packet);
         ++i)
    {
        uint16_t address =
            packet_mesh_trs_control_friend_sublist_add_remove_address_list_get(
                p_control_packet->p_data, i);
        uint32_t status = friend_sublist_remove(&p_friendship->sublist, address);
        (void) status;
        __LOG(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Remove sublist addr 0x%04x: %u\n", address, status);
    }

    friend_sublist_confirm_tx(p_friendship, transaction_number, p_rx_metadata);
    poll_timeout_schedule(p_friendship,
                          (p_rx_metadata->params.scanner.timestamp +
                           MS_TO_US(p_friendship->friendship.poll_timeout_ms)));
}

static const transport_control_packet_handler_t m_transport_opcode_handlers[] = {
    {TRANSPORT_CONTROL_OPCODE_FRIEND_POLL, friend_poll_handle},
    {TRANSPORT_CONTROL_OPCODE_FRIEND_REQUEST, friend_request_handle},
    {TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR, friend_clear_handle},
    {TRANSPORT_CONTROL_OPCODE_FRIEND_CLEAR_CONFIRM, friend_clear_confirm_handle},
    {TRANSPORT_CONTROL_OPCODE_FRIEND_SUBSCRIPTION_LIST_ADD, friend_sublist_add_handle},
    {TRANSPORT_CONTROL_OPCODE_FRIEND_SUBSCRIPTION_LIST_REMOVE, friend_sublist_remove_handle}};

static void friend_update_enqueue(friendship_t * p_friendship)
{
    NRF_MESH_ASSERT_DEBUG(m_friend.enabled);

    uint16_t unicast_address;
    uint16_t element_count;
    nrf_mesh_unicast_address_get(&unicast_address, &element_count);

    const nrf_mesh_network_secmat_t * p_secmat = NULL;
    nrf_mesh_friendship_secmat_get(p_friendship->friendship.lpn.src, &p_secmat);
    NRF_MESH_ASSERT_DEBUG(p_secmat != NULL);

    transport_packet_metadata_t trs_metadata = {
        .segmented = false,
        .receivers = TRANSPORT_PACKET_RECEIVER_FRIEND,
        .mic_size = PACKET_MESH_TRS_TRANSMIC_CONTROL_SIZE,
        .type.control.opcode = TRANSPORT_CONTROL_OPCODE_FRIEND_UPDATE,
        .net = {
            .control_packet = true,
            .dst = {
                .value = p_friendship->friendship.lpn.src,
                .type = NRF_MESH_ADDRESS_TYPE_UNICAST
            },
            .src = unicast_address,
            .p_security_material = p_secmat,
            .ttl = 0
        },
        .tx_bearer_selector = CORE_TX_BEARER_TYPE_FRIEND,
        .token = p_friendship->bearer.token
    };

    packet_mesh_trs_packet_t friend_update_packet;
    packet_mesh_trs_control_opcode_set(&friend_update_packet,
                                       TRANSPORT_CONTROL_OPCODE_FRIEND_UPDATE);

