NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
    packet_mesh_trs_control_packet_t * p_friend_update =
        (packet_mesh_trs_control_packet_t *) &friend_update_packet.pdu[PACKET_MESH_TRS_UNSEG_PDU_OFFSET];

    memset(p_friend_update, 0, PACKET_MESH_TRS_CONTROL_FRIEND_UPDATE_SIZE);

    packet_mesh_trs_control_friend_update_iv_update_flag_set(
        p_friend_update, (net_state_iv_update_get() == NET_STATE_IV_UPDATE_IN_PROGRESS));
    packet_mesh_trs_control_friend_update_iv_index_set(
        p_friend_update, net_state_beacon_iv_index_get());

    packet_mesh_trs_control_friend_update_key_refresh_flag_set(
        p_friend_update, (nrf_mesh_key_refresh_phase_get(p_secmat)
                         == NRF_MESH_KEY_REFRESH_PHASE_2));

    /* The MD bit must be set when we actually relay the packet. */
    __LOG_XB(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Friend Update Queue",
             p_friend_update->pdu,
             PACKET_MESH_TRS_CONTROL_FRIEND_UPDATE_SIZE);
    friend_queue_packet_push(&p_friendship->queue,
                             &friend_update_packet,
                             PACKET_MESH_TRS_CONTROL_FRIEND_UPDATE_SIZE +
                             PACKET_MESH_TRS_UNSEG_PDU_OFFSET,
                             &trs_metadata,
                             CORE_TX_ROLE_ORIGINATOR);
}

static void iv_update_handle(void)
{
    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        if (m_friend.friends[i].state == FRIEND_STATE_ESTABLISHED)
        {
            friend_update_enqueue(&m_friend.friends[i]);
        }
    }
}

static bool is_subnet_of_friend(const friendship_t * p_friendship,
                                const nrf_mesh_network_secmat_t * p_secmat)
{
    const nrf_mesh_network_secmat_t * p_friend_secmat = NULL;
    nrf_mesh_friendship_secmat_get(p_friendship->friendship.lpn.src, &p_friend_secmat);
    NRF_MESH_ASSERT_DEBUG(p_friend_secmat != NULL);

    const nrf_mesh_network_secmat_t * p_master_secmat = nrf_mesh_net_master_secmat_get(p_friend_secmat);
    NRF_MESH_ASSERT_DEBUG(p_master_secmat != NULL);

    return ((intptr_t) p_master_secmat == (intptr_t) p_secmat);
}

static void key_refresh_handle(const nrf_mesh_evt_key_refresh_notification_t * p_evt)
{
    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        if (m_friend.friends[i].state == FRIEND_STATE_ESTABLISHED &&
            is_subnet_of_friend(&m_friend.friends[i],
                                nrf_mesh_net_secmat_from_index_get(p_evt->subnet_index)))
        {
            friend_update_enqueue(&m_friend.friends[i]);
        }
    }
}

static void mesh_evt_cb(const nrf_mesh_evt_t * p_evt)
{
    if (!m_friend.enabled)
    {
        return;
    }

    switch (p_evt->type)
    {
        case NRF_MESH_EVT_IV_UPDATE_NOTIFICATION:
            iv_update_handle();
            break;

        case NRF_MESH_EVT_KEY_REFRESH_NOTIFICATION:
            key_refresh_handle(&p_evt->params.key_refresh);
            break;

        default:
            break;
    }
}

/*****************************************************************************
 * Interface functions
 *****************************************************************************/
uint32_t mesh_friend_init(void)
{
#ifdef UNIT_TEST
    memset(&m_friend, 0, sizeof(m_friend));
#endif
    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        m_friend.friends[i].state = FRIEND_STATE_IDLE;
        m_friend.friends[i].poll_timeout.p_context = &m_friend.friends[i];
        m_friend.friends[i].poll_timeout.cb = poll_timeout_cb;
        m_friend.friends[i].clear_repeat_timer.p_context = &m_friend.friends[i];
        m_friend.friends[i].clear_repeat_timer.cb = friend_clear_timeout_cb;

        friend_queue_init(&m_friend.friends[i].queue);
        friend_sublist_init(&m_friend.friends[i].sublist);

        core_tx_friend_init(&m_friend.friends[i].bearer,
                            NRF_MESH_FRIEND_TOKEN_BEGIN + i);
    }
    /* TODO: Handle enabled/disabled state. */
    m_friend.default_receive_window_ms = MESH_FRIEND_RECEIVE_WINDOW_DEFAULT_MS;
    NRF_MESH_ASSERT_DEBUG((transport_control_packet_consumer_add(
                               &m_transport_opcode_handlers[0],
                               ARRAY_SIZE(m_transport_opcode_handlers))
                           == NRF_SUCCESS));

    m_friend.mesh_evt_handler.evt_cb = mesh_evt_cb;
    nrf_mesh_evt_handler_add(&m_friend.mesh_evt_handler);
    return NRF_SUCCESS;
}

void mesh_friend_enable(void)
{
    NRF_MESH_ERROR_CHECK(mesh_opt_friend_set(true));
}

void mesh_friend_disable(void)
{
    NRF_MESH_ERROR_CHECK(mesh_opt_friend_set(false));
    (void) mesh_friend_friendship_terminate_all();
}

bool mesh_friend_is_enabled(void)
{
    return m_friend.enabled;
}

uint32_t mesh_friend_friendship_terminate(const mesh_friendship_t * p_friendship)
{
    if (p_friendship == NULL)
    {
        return NRF_ERROR_NULL;
    }
    else
    {
        for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
        {
            if ((intptr_t) p_friendship == (intptr_t) &m_friend.friends[i].friendship)
            {
                friendship_terminate(&m_friend.friends[i],
                                     NRF_MESH_EVT_FRIENDSHIP_TERMINATED_REASON_USER);
                return NRF_SUCCESS;
            }
        }
        return NRF_ERROR_NOT_FOUND;
    }
}

uint32_t mesh_friend_friendship_terminate_all(void)
{
    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        if (m_friend.friends[i].state != FRIEND_STATE_IDLE)
        {
            friendship_terminate(&m_friend.friends[i],
                                 NRF_MESH_EVT_FRIENDSHIP_TERMINATED_REASON_USER);
        }
    }
    return NRF_SUCCESS;
}

uint32_t mesh_friend_receive_window_set(uint8_t receive_window_ms)
{
    /* MESH_FRIEND_RECEIVE_WINDOW_MAX_MS is 0xFF. uint8_t cannot exceed this value. */
    if (receive_window_ms < MESH_FRIEND_RECEIVE_WINDOW_MIN_MS)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    m_friend.default_receive_window_ms = receive_window_ms;
    return NRF_SUCCESS;
}

uint32_t mesh_friend_friendships_get(const mesh_friendship_t ** pp_friendships, uint8_t * p_count)
{
    if (p_count == NULL || pp_friendships == NULL || *pp_friendships == NULL)
    {
        return NRF_ERROR_NULL;
    }

    uint8_t input_count = *p_count;
    *p_count = 0;

    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT && *p_count < input_count; ++i)
    {
        if (m_friend.friends[i].state == FRIEND_STATE_ESTABLISHED)
        {
            pp_friendships[i] = &m_friend.friends[i].friendship;
            (*p_count)++;
        }
    }
    return NRF_SUCCESS;
}

