NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/friend/src/friend.c
uint32_t mesh_opt_friend_set(bool enabled)
{
    return mesh_config_entry_set(MESH_OPT_FRIEND_EID, &enabled);
}

uint32_t mesh_opt_friend_get(bool * p_enabled)
{
    return mesh_config_entry_get(MESH_OPT_FRIEND_EID, p_enabled);
}

uint32_t mesh_friend_stats_get(const mesh_friendship_t * p_friendship, mesh_friend_stats_t * p_stats)
{
    if (p_friendship == NULL || p_stats == NULL)
    {
        return NRF_ERROR_NULL;
    }

#if FRIEND_DEBUG
    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        if ((intptr_t) p_friendship == (intptr_t) &m_friend.friends[i].friendship)
        {
            p_stats->bearer  = m_friend.friends[i].bearer.stats;
            p_stats->queue   = m_friend.friends[i].queue.stats;
            p_stats->sublist = m_friend.friends[i].sublist.stats;
            return NRF_SUCCESS;
        }
    }
    return NRF_ERROR_NOT_FOUND;
#else
    return NRF_ERROR_NOT_SUPPORTED;
#endif
}

/* Internal API */
void friend_packet_in(const packet_mesh_trs_packet_t * p_packet,
                      uint8_t length,
                      const transport_packet_metadata_t * p_metadata,
                      core_tx_role_t role)
{
    NRF_MESH_ASSERT_DEBUG(p_packet != NULL);
    NRF_MESH_ASSERT_DEBUG(p_metadata != NULL);
    NRF_MESH_ASSERT_DEBUG(length <= sizeof(packet_mesh_trs_packet_t));

    if (!m_friend.enabled)
    {
        return;
    }

    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        friendship_t * p_friendship = &m_friend.friends[i];
        if (friend_address_is_known(p_friendship,
                                    p_metadata->net.dst))
        {
            NRF_MESH_ASSERT_DEBUG(p_friendship != NULL);
            __LOG_XB(LOG_SRC_FRIEND, LOG_LEVEL_DBG1, "Packet Queue", p_packet->pdu, length);
            friend_queue_packet_push(&p_friendship->queue,
                                     p_packet,
                                     length,
                                     p_metadata,
                                     role);
        }
    }
}

bool friend_needs_packet(const transport_packet_metadata_t * p_metadata)
{
    NRF_MESH_ASSERT_DEBUG(p_metadata != NULL);
    if (!m_friend.enabled)
    {
        return false;
    }

    /* No relaying for TTL < 2 (Mesh profile v1.0,  sec. 3.5.5). */
    if (p_metadata->net.ttl < 2)
    {
        return false;
    }

    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        if (friend_address_is_known(&m_friend.friends[i],
                                    p_metadata->net.dst))
        {
            return true;
        }
    }
    return false;
}

void friend_sar_complete(uint16_t src, uint32_t seqzero, bool success)
{
    if (!m_friend.enabled)
    {
        return;
    }

    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        if (m_friend.friends[i].state == FRIEND_STATE_ESTABLISHED)
        {
            friend_queue_sar_complete(&m_friend.friends[i].queue, src, success);
        }
    }
}

bool friend_friendship_established(uint16_t src)
{
    if (!m_friend.enabled)
    {
        return false;
    }

    for (uint32_t i = 0; i < MESH_FRIEND_FRIENDSHIP_COUNT; ++i)
    {
        if (m_friend.friends[i].friendship.lpn.src == src)
        {
            return true;
        }
    }
    return false;
}

uint32_t friend_remaining_poll_timeout_time_get(uint16_t src)
{
    friendship_t * p_friendship = friendship_find(src);
    if (p_friendship != NULL)
    {
        return ROUNDED_DIV(US_TO_MS(remaining_poll_timeout_time_get(p_friendship)), 100);
    }
    else
    {
        return 0;
    }
}

#endif  /* MESH_FEATURE_FRIEND_ENABLED */
